Tekla.Structures.DrawingInternal.QueryTypeEnum


Tekla.Structures.DrawingInternal.QueryTypeEnum.QUERY_DELETE


Tekla.Structures.DrawingInternal.QueryTypeEnum.QUERY_INSERT


Tekla.Structures.DrawingInternal.QueryTypeEnum.QUERY_UPDATE


Tekla.Structures.DrawingInternal.QueryTypeEnum.QUERY_SELECT


Tekla.Structures.DrawingInternal.QueryTypeEnum.QUERY_CACHED_SELECT


Tekla.Structures.DrawingInternal.QueryTypeEnum.QUERY_CACHED_UPDATE


Tekla.Structures.DrawingInternal.QueryTypeEnum.QUERY_LIMITED_SELECT


Tekla.Structures.DrawingInternal.QueryTypeEnum.QUERY_LIMITED_UPDATE


Tekla.Structures.DrawingInternal.QueryTypeEnum.ATTRIBUTES_LOAD


Tekla.Structures.DrawingInternal.QueryTypeEnum.LOAD_SYMBOL_LIBRARIES


Tekla.Structures.DrawingInternal.QueryTypeEnum.RETRIEVE_ATTRIBUTES


Tekla.Structures.DrawingInternal.QueryTypeEnum.DRAWING_COMMIT_CHANGES


Tekla.Structures.DrawingInternal.QueryTypeEnum.DRAWING_PLACE_VIEWS


Tekla.Structures.DrawingInternal.QueryTypeEnum.DRAWING_LOAD_LAYOUT_ATTRIBUTES


Tekla.Structures.DrawingInternal.QueryTypeEnum.DRAWING_UPDATE


Tekla.Structures.DrawingInternal.QueryTypeEnum.DRAWING_CHECK_PART_TYPE


Tekla.Structures.DrawingInternal.QueryTypeEnum.DRAWING_ISSUE


Tekla.Structures.DrawingInternal.QueryTypeEnum.DRAWING_UNISSUE


Tekla.Structures.DrawingInternal.QueryTypeEnum.DRAWING_FILTER_SELECT


Tekla.Structures.DrawingInternal.QueryTypeEnum.DRAWING_FILTER_MODIFY


Tekla.Structures.DrawingInternal.QueryTypeEnum.DRAWING_CHECK_NUMBERING_IS_UPTODATE


Tekla.Structures.DrawingInternal.QueryTypeEnum.HANDLER_SET_ACTIVE_DRAWING


Tekla.Structures.DrawingInternal.QueryTypeEnum.HANDLER_SAVE_AND_CLOSE_ACTIVE_DRAWING


Tekla.Structures.DrawingInternal.QueryTypeEnum.HANDLER_GET_ACTIVE_DRAWING_ID


Tekla.Structures.DrawingInternal.QueryTypeEnum.HANDLER_GET_ACTIVE_DRAWING_TYPE


Tekla.Structures.DrawingInternal.QueryTypeEnum.HANDLER_GET_DRAWING_TYPE


Tekla.Structures.DrawingInternal.QueryTypeEnum.HANDLER_GET_MODELOBJECTS_FROM_DRAWING


Tekla.Structures.DrawingInternal.QueryTypeEnum.HANDLER_GET_CACHED_DRAWING_TYPE


Tekla.Structures.DrawingInternal.QueryTypeEnum.HANDLER_LAYOUT_EDITOR_QUERY


Tekla.Structures.DrawingInternal.QueryTypeEnum.HANDLER_LAYOUT_EDITOR_OPERATION


Tekla.Structures.DrawingInternal.QueryTypeEnum.HANDLER_TABLELAYOUT_TABLE_QUERY


Tekla.Structures.DrawingInternal.QueryTypeEnum.HANDLER_TABLELAYOUT_TABLE_OPERATION


Tekla.Structures.DrawingInternal.QueryTypeEnum.HANDLER_TABLELAYOUT_QUERY


Tekla.Structures.DrawingInternal.QueryTypeEnum.HANDLER_TABLELAYOUT_OPERATION


Tekla.Structures.DrawingInternal.QueryTypeEnum.HANDLER_SET_PARTIAL_CLONING_OPERATION


Tekla.Structures.DrawingInternal.QueryTypeEnum.HANDLER_CHECK_MODEL_STATUS


Tekla.Structures.DrawingInternal.QueryTypeEnum.AUTOMATION_RUN_AUTODRAWINGS


Tekla.Structures.DrawingInternal.QueryTypeEnum.UDA_QUERY_GET
Get property from TS

Tekla.Structures.DrawingInternal.QueryTypeEnum.UDA_QUERY_SET
Set property to TS

Tekla.Structures.DrawingInternal.QueryTypeEnum.UDA_QUERY_ALL_STRINGS
Get all string properties

Tekla.Structures.DrawingInternal.QueryTypeEnum.UDA_QUERY_ALL_DOUBLES
Get all double properties

Tekla.Structures.DrawingInternal.QueryTypeEnum.UDA_QUERY_ALL_INTEGERS
Get all integer properties